# Basic Pandas Operations

In [1]:
# See Pandas 0.25.1 documentation  
# https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

# import numpy and pandas modules
import numpy as np
import pandas as pd

## Create Pandas Dataframe

In [2]:
# We will use a small dataset for a simple example
# data stored in a python dictionary 
data = {
    'dogs': [23, 17, 5, 12, 1, 5],
    'birds': [10, 7, 13, 2, 8, 19],
    'cats': [4, 14, 8, 15, 11, 3]}
data

{'dogs': [23, 17, 5, 12, 1, 5],
 'birds': [10, 7, 13, 2, 8, 19],
 'cats': [4, 14, 8, 15, 11, 3]}

In [3]:
# convert dictionary to a pandas dataframe
# notice that index numbers are serially generated
shelter = pd.DataFrame(data)
shelter

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [4]:
# information about the dataframe
shelter.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
dogs     6 non-null int64
birds    6 non-null int64
cats     6 non-null int64
dtypes: int64(3)
memory usage: 272.0 bytes

In [5]:
# Take a look at the head of the dataframe
shelter.head(n=3)

   dogs  birds  cats
0    23     10     4
1    17      7    14
2     5     13     8

In [6]:
# Gives the last 5 values (tail of dataframe)
shelter.tail()

   dogs  birds  cats
1    17      7    14
2     5     13     8
3    12      2    15
4     1      8    11
5     5     19     3

In [7]:
# create a dataframe with index names specified
# data is the dataset in dictionary format
# index names are in a list format
idx_names = ['shelter0', 'shelter1', 'shelter2', 'shelter3', 'shelter4', 'shelter5']

shelter_indexname = pd.DataFrame(data, index = idx_names)
shelter_indexname

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

## Working with Rows and Columns

In [8]:
# select row only by label, using loc[]
# .loc refers to label
shelter_indexname.loc['shelter3']

dogs     12
birds     2
cats     15
Name: shelter3, dtype: int64

In [9]:
# select row and column, using loc[]
# .loc refers to label

shelter_indexname.loc['shelter3', 'birds']

2

In [10]:
# slice by row, using index positions, python way

shelter_indexname[2:5]

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11

In [11]:
# slice by row, using label names (values and not index position)

shelter_indexname['shelter2':'shelter5']

          dogs  birds  cats
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [12]:
# select column with slice method (all rows, and column at index position 1)
# you will get back the birds column, which is index position 1 column-wise
# i refers to index
shelter_indexname.iloc[:, 1]

shelter0    10
shelter1     7
shelter2    13
shelter3     2
shelter4     8
shelter5    19
Name: birds, dtype: int64

In [13]:
# select multiple rows and multiple columns with slice method
# similar to pythonic way of indexing
shelter_indexname.iloc[2:5, 0:2]

          dogs  birds
shelter2     5     13
shelter3    12      2
shelter4     1      8

In [14]:
# select column using dot notation or bracket
# shelter_indexname.dogs

shelter_indexname['dogs']

shelter0    23
shelter1    17
shelter2     5
shelter3    12
shelter4     1
shelter5     5
Name: dogs, dtype: int64

In [15]:
# select multiple columns with brackets
shelter_indexname[['dogs', 'cats']]

          dogs  cats
shelter0    23     4
shelter1    17    14
shelter2     5     8
shelter3    12    15
shelter4     1    11
shelter5     5     3

In [16]:
# select column names
# no parentheses
shelter_indexname.columns

Index(['dogs', 'birds', 'cats'], dtype='object')

In [17]:
# sorting by values
shelter_indexname.sort_values(by='cats')

          dogs  birds  cats
shelter5     5     19     3
shelter0    23     10     4
shelter2     5     13     8
shelter4     1      8    11
shelter1    17      7    14
shelter3    12      2    15

In [18]:
# summary statistics
shelter_indexname.describe()

           dogs      birds       cats
count   6.00000   6.000000   6.000000
mean   10.50000   9.833333   9.166667
std     8.38451   5.776389   5.036533
min     1.00000   2.000000   3.000000
25%     5.00000   7.250000   5.000000
50%     8.50000   9.000000   9.500000
75%    15.75000  12.250000  13.250000
max    23.00000  19.000000  15.000000

In [19]:
# transpose data (rows become columns and columns become rows)
shelter_indexname.T

       shelter0  shelter1  shelter2  shelter3  shelter4  shelter5
dogs         23        17         5        12         1         5
birds        10         7        13         2         8        19
cats          4        14         8        15        11         3

In [ ]:
# end of section

## Advanced Pandas Operations

In [ ]:
# Demonstration of lambda, apply, map, filter, reduce, and groupby

In [20]:
# Let's see the dataframe again with shelter names
shelter_indexname

          dogs  birds  cats
shelter0    23     10     4
shelter1    17      7    14
shelter2     5     13     8
shelter3    12      2    15
shelter4     1      8    11
shelter5     5     19     3

In [21]:
# Use of apply and lambda
shelter_indexname['dogs'] = shelter_indexname['dogs'].apply(lambda x: x*17)
shelter_indexname['birds'] = shelter_indexname['birds'].apply(lambda x: x*8)
shelter_indexname['cats'] = shelter_indexname['cats'].apply(lambda x: x*23)
shelter_indexname

          dogs  birds  cats
shelter0   391     80    92
shelter1   289     56   322
shelter2    85    104   184
shelter3   204     16   345
shelter4    17     64   253
shelter5    85    152    69

In [22]:
# Use of apply and map
# Apply a function to a Dataframe elementwise.
shelter_indexname = shelter_indexname.applymap(lambda x: x/2.0)
shelter_indexname

           dogs  birds   cats
shelter0  195.5   40.0   46.0
shelter1  144.5   28.0  161.0
shelter2   42.5   52.0   92.0
shelter3  102.0    8.0  172.5
shelter4    8.5   32.0  126.5
shelter5   42.5   76.0   34.5

In [23]:
# Use of filter with brackets
# Where the condition is met, the actual value shows, otherwise NaN
# Where do we have values less than 50?
results_filter = shelter_indexname[shelter_indexname < 50]
results_filter

          dogs  birds  cats
shelter0   NaN   40.0  46.0
shelter1   NaN   28.0   NaN
shelter2  42.5    NaN   NaN
shelter3   NaN    8.0   NaN
shelter4   8.5   32.0   NaN
shelter5  42.5    NaN  34.5

In [24]:
# filtering with query method
# Where do we have more than 30 cats?
results_filter.query('cats > 30', inplace = True)
results_filter

          dogs  birds  cats
shelter0   NaN   40.0  46.0
shelter5  42.5    NaN  34.5

In [25]:
# example of summation by column
dogs_sum = shelter_indexname['dogs'].sum()
dogs_sum

535.5

In [26]:
# display dataframe again
shelter_indexname

           dogs  birds   cats
shelter0  195.5   40.0   46.0
shelter1  144.5   28.0  161.0
shelter2   42.5   52.0   92.0
shelter3  102.0    8.0  172.5
shelter4    8.5   32.0  126.5
shelter5   42.5   76.0   34.5

In [27]:
# Row-wise operation with axis = 0 for a Numpy array
# Reduce using apply and np.sum
# FutureWarning: The reduce argument is deprecated and will be removed in a future version.
#df_sum_column = shelter_indexname.apply(np.sum, reduce=True, axis=0)

# np.sum sums down the rows per column when we set axis = 0, 0 refers to the row axis for a NumPy array
# Row-wise operation
df_sum_column = shelter_indexname.apply(np.sum, axis=0)
df_sum_column

dogs     535.5
birds    236.0
cats     632.5
dtype: float64

In [28]:
# Column-wise operation with axis = 1 for a NumPy array
# You get back sum totals per row
df_sum_row = shelter_indexname.apply(np.sum, axis=1)
df_sum_row

shelter0    281.5
shelter1    333.5
shelter2    186.5
shelter3    282.5
shelter4    167.0
shelter5    153.0
dtype: float64

In [29]:
# Create a fourth column that has a list of boolean values
new_col = [True, True, False, True, False, False]

# Assign list to be the new column name
shelter_indexname['foster'] = new_col
shelter_indexname

           dogs  birds   cats  foster
shelter0  195.5   40.0   46.0    True
shelter1  144.5   28.0  161.0    True
shelter2   42.5   52.0   92.0   False
shelter3  102.0    8.0  172.5    True
shelter4    8.5   32.0  126.5   False
shelter5   42.5   76.0   34.5   False

In [30]:
# Use groupby and sum, aggregate functions
# You will attain the aggregate sums across shelters where False or True
shelter_indexname.groupby('foster').sum()

         dogs  birds   cats
foster
False    93.5  160.0  253.0
True    442.0   76.0  379.5

In [ ]:
# end of section